  {
    " Good Morning, ": "صباح الخير،",
    "What would you like to cook today ?": "ماذا تحب ان تطبخ اليوم؟",
    "Today's Fresh Recipes": "وصفات اليوم",
    "See All": "مشاهدة الكل",
    "Search for recipes": "ابحث عن وصفه",
    "Recommended": "المقترحات",
      "View Profile": "الملف الشخصي",
    "Language": "اللغة",
      "Select your favorites language": "اختر لغتك المفضله",
      "Set language": "اختر اللغه",
      "Arabic": "العربيه",
    "searching": "بحث",
    "No Selected Recipes": "قم باختيار وصفه",
    "Please choose the ingredients which available in your kitchen :": "قم بإختيار المكونات الموجودة في مطبخك",
    "pepper": "فلفل",
    "onion": "بصل",
    "vinegar": "خل",
    "pasta": "مكرونة",
    "salt": "ملح",
    "oil":
    "زيت",
    "tomato":
    "طماطم",
    "cheese": "جبن",
    "sugar": "سكر",
    "eggs": "بيض",
    "garlic": "ثوم",
    "rice": "أرز",
    "chicken": "دجاج",
    "berries": "توت",
      "butter": "زبدة",
      "Update Profile": "تحديث الملف الشخصي",
      "Phone Number": "رقم الهاتف",
      "User name": "اسم المستخدم",
    "Our Recipes": "وصفاتنا",
    "No recipes matched the filter criteria.": "لا توجد وصفات مطابقة لمعايير التصفية.",
    "Filters Recipes": "الوصفات المطابقة",
    "Edit Profile": "تعديل الملف الشخصي",
      "Home": "الصفحة الرئيسية",
      "Favorites": "المفضله",
    "RecentlyViewed": "المشاهدات",
    "My Kitchen": "مطبخي",
    "Filter": "التصفيات",
    "Reset": "إعادة ضبط",
    "Meal": "الوجبة",
    "Settings": "الاعدادات",
    "Profile": "الملف الشخصي",
    "SignOut": "الخروج",
    "DINNER": "العشاء",
      "SOUP":"الحساء",
      "SALAD": "السلطه",
      "HEALTHY": "صحي",
      "DESSERT": "حلويات",
      "QUICK&EASY": "سهلة وسريعة ",
      "BREAKFAST": "الافطار",
    "VEGETARIAN": "نباتي",
    " Cal.": "سعر حراراي",
    "Apply": "تطبيق",
      "Close": "رجوع",
    "Select number of serving :":"اختر عدد الاشخاص :",
    "Preparation Time": "وقت التحضير",
    "Select Preparation Time :": "اختر وقت التحضير :",
    "Select Calories numbers :": "اختر عدد السعرات الحرارية :",
    "Mexican pulled meat rice bowl": "أرز باللحم المكسيكي",
    " Chicken Soup": "حساء الدجاج",
    "Roasted Fall Vegetable Salad": "سلطة الخضار المشوية",
    "Feta and pea pasta": "معكرونة الفيتا والبازلاء",
    "Summer Fruit Icebox Cake": "كعكة الفاكهة الصيفية",
    "Heart-Shaped Pizza": "بيتزا على شكل قلب",
    "Croissant French Toast Bake": "خبز الكرواسون بالتوست الفرنسي",


    "800g packet Cook Mild Mexican Inspired Meat Shoulder": "800 جرام لحم كتف مطبوخ خفيف",
    "2 x 240g tubs Old El Paso Mexi Rice with Chilli and Veggies": "2 × 240 جرام أرز إل باسو مكسي بالفلفل الحار والخضار",
    "250g cherry tomatoes, halved": "250 جرام طماطم كرزية، مقطعة إلى نصفين",
    "1 large avocado, sliced": "1 حبة أفوكادو كبيرة، مقطعة",
    "100g packet baby spinach": " 100 جرام سبانخ صغيرة",
    "Olive oil, to drizzle": "زيت زيتون، للرش",
    " Calories": " سعر حراراي ",
      " mins": "دقيقة",
    " serving": "اشخاص",
    "Serving": "اشخاص",
    "Ingredients": "المقادير",
      "Directions": "الطريقة",
      "Step": "خطوة",
    "lemon salmon spaghetti": "اسباجيتي السلمون والليمون",
    "Chicken caesar salad": "سلطة سيزر بالدجاج",
    "Tropical punch mocktail": "كوكتيل الفواكه الاستوائية",
    "Quick vegetarian meatballs": "كرات اللحم النباتية السريعة",
    "Warm meat in the microwave following packet directions. Transfer to a large bowl and shred the meat with 2 forks.": "قم بتسخين اللحم في الميكروويف باتباع تعليمات العبوة. ننقله إلى وعاء كبير ونقطع اللحم بشوكتين.",
    "Meanwhile, warm the rice following packet directions.": "في هذه الأثناء، قومي بتسخين الأرز باتباع التعليمات الموجودة على العبوة.",
    "Divide rice and meat among serving bowls. Top with the tomato, avocado and spinach. Season and drizzle over a little oil to serve."
    : "قم بتقسيم الأرز واللحوم بين أوعية التقديم. ضع فوقها الطماطم والأفوكادو والسبانخ. ثم قم بتتبيلها ورشها فوق القليل من الزيت لتقديمها.",

    "1 medium red onion, finely diced": "1 بصلة حمراء متوسطة الحجم، مفرومة ناعماً",
    "2 garlic cloves, finely chopped": "2 فص ثوم مفروم ناعماً",
    "1 cup (75g) torn sourdough bread": "1 كوب (75 جرام) خبز مخمر",
    "1/2 cup frozen peas": "1/2 كوب بازلاء مجمدة",
    "Pinch ground nutmeg": "حبة جوزة الطيب المطحونة",
    "100g Danish feta cheese": "100 جرام جبنة فيتا ",
    "2 tsp finely grated lemon rind ": "2 ملعقة صغيرة قشر ليمون مبشور ناعم",
    "1/3 cup small fresh basil leaves": "1/3 كوب أوراق ريحان طازجة صغيرة الحجم",
    "Cook pasta in a saucepan of boiling, salted water, following packet directions, until tender. ": "اسلقي المعكرونة في قدر من الماء المغلي والمملح، حسب تعليمات العبوة، حتى تصبح طرية.",
    "Add pasta to pan with nutmeg, feta and lemon rind. Cook, tossing, for 1 to 2 minutes or until warmed through. Add basil. Season with pepper. Toss to combine. Serve.":"أضيفي المعكرونة إلى المقلاة مع جوزة الطيب وجبن الفيتا وقشر الليمون. اطهيها مع التقليب لمدة دقيقة إلى دقيقتين أو حتى تسخن. أضيفي الريحان. تبلي بالفلفل. قلبي المكونات معًا وقدميها.",
      "Heat oil in a large saucepan over medium heat. Add onion and garlic. Cook for 3 minutes or until onion has softened. Add bread. Cook, tossing, for 3 minutes or until bread starts to turn golden. Add peas. Cook, tossing, for 2 minutes or until heated through.":"يُسخن الزيت في قدر كبيرة على نار متوسطة. يُضاف البصل والثوم. يُطهى لمدة 3 دقائق أو حتى ينضج البصل. يُضاف الخبز. يُطهى مع التقليب لمدة 3 دقائق أو حتى يبدأ الخبز في التحول إلى اللون الذهبي. تُضاف البازلاء. يُطهى مع التقليب لمدة دقيقتين أو حتى يسخن.",

      "1/2 cup (125ml) pineapple juice": "1/2 كوب (125 مل) عصير أناناس",
    "1 orange, thinly sliced": "1 برتقالة، مقطعة إلى شرائح رفيعة",
    "4 lemongrass stems, bruised": "4 اوراق عشبة الليمون ",
    "4 x 375ml cans chilled Mount Franklin Lightly Sparkling Passionfruit": "4 × 375 مل علب مبردة من مشروب غازي سبرايت ",
    "Mint sprigs, to serve": "أوراق النعناع للتقديم",
    "Divide pineapple juice evenly among two 12-hole, 2-tsp (10ml) ice cube trays. Freeze overnight or until frozen.": "قسّم عصير الأناناس بالتساوي بين صواني مكعبات الثلج المكونة من 12 حفرة وملعقتين صغيرتين (10 مل). قم بتجميدها طوال الليل أو حتى تجمد.",
    "Divide the orange slices, pineapple ice cubes and lemongrass among serving glasses. Pour over the Mount Franklin Lightly Sparkling Passionfruit. Top with mint to serve.": "قسّم شرائح البرتقال ومكعبات ثلج الأناناس وعشب الليمون بين أكواب التقديم. واسكبها فوق فاكهة العاطفة المتلألئة من ماونت فرانكلين. وزينها بالنعناع للتقديم.",

    "Chocolate chip cookies": "كوكيز رقائق الشوكولاتة",
    "185g butter, softened": "185 جرام زبدة طرية",
      "1 cup (200g) brown sugar": "1 كوب (200 جرام) سكر بني",
    "1/2 cup (100g) caster sugar": "1/2 كوب (100 جرام) سكر ناعم",
    "1 egg": "1 بيضة",
    "1 egg yolk": "1 صفار بيضة",
    "2 cups (300g) plain flour": "2 كوب (300 جرام) دقيق عادي",
    "1/2 tsp baking powder": "1/2 ملعقة صغيرة بيكنج بودر",
    "200g dark chocolate, coarsely chopped": "200 جرام شوكولاتة داكنة، مفرومة خشنًا",
    "Preheat oven to 180C. Line 2 oven trays with baking paper.": "سخني الفرن إلى 180 درجة مئوية. قومي بتبطين 2 صينية فرن بورق الخبز.",
      "Use an electric mixer to beat the butter and combined sugars in a medium bowl until pale and creamy. Add the egg and egg yolk and beat until well combined. Add the flour and baking powder and stir with a wooden spoon until combined. Add the chocolate and stir to combine."
: "استخدمي خلاطًا كهربائيًا لخفق الزبدة والسكريات معًا في وعاء متوسط ​​الحجم حتى يصبح لونه شاحبًا وكريميًا. أضيفي البيضة وصفار البيض واخفقي حتى تمتزج جيدًا. أضيفي الدقيق والبيكنج باودر وقلبي بملعقة خشبية حتى تمتزج المكونات. أضيفي الدقيق الشوكولاتة ويقلب ليمتزج.",

      "Roll 2 tablespoonsful of mixture into a ball. Place on the lined tray and gently flatten. Repeat with remaining dough. Bake in preheated oven for 12 minutes (or a further 5 minutes for a crisper biscuit). Remove from oven and set aside on the tray to cool completely.": "شكلي ملعقتين كبيرتين من الخليط على شكل كرة. ضعيها على الصينية المبطنة ثم افرديها بلطف. كرري ذلك مع العجين المتبقي. اخبزيها في فرن مسخن مسبقاً لمدة 12 دقيقة (أو 5 دقائق أخرى للحصول على بسكويت مقرمش). أخرجيها من الفرن واتركيها جانباً. الصينية حتى تبرد تماماً.",

    "1 pound prepared pizza dough": "1 كيلو من عجينة البيتزا الجاهزة",
    "1/2 cup pizza sauce":"1/2 كوب صلصة البيتزا",
    "3/4 cup shredded mozzarella cheese": "3/4 كوب جبنة موتزاريلا مبشورة",
    "1/4 cup shredded Parmesan cheese":"ربع كوب جبنة بارميزان مبشورة",
    "1/4 cup crumbled cooked sausage":"ربع كوب نقانق مطبوخة ومفتتة",
    "1/4 cup pepperoni slices, or as needed": "ربع كوب شرائح بيبروني أو حسب الحاجة",
    "Allow dough to come to room temperature, about 30 minutes.": "اتركي العجينة لتصل إلى درجة حرارة الغرفة، حوالي 30 دقيقة.",
    "Preheat the oven to 450 degrees F (230 degrees C).": "سخني الفرن إلى230 درجة مئوية.",
    "Divide the dough into 2 unequal pieces. One piece of dough should be smaller. Take the larger piece and press out into a square shape. Take the smaller piece and roll into a circle. Cut the circle in half.": "نقسم العجينة إلى قطعتين غير متساويتين. قطعة واحدة من العجين يجب أن تكون أصغر. خذ القطعة الأكبر واضغط عليها لتشكل شكل مربع. خذ القطعة الأصغر ولفها على شكل دائرة. اقطع الدائرة إلى نصفين.",
    "Take a teaspoon of oil and brush a pizza stone. Position the dough square on the pizza stone with one point of the square pointing down.":"خذي ملعقة صغيرة من الزيت وادهني حجر البيتزا. ضعي مربع العجين على حجر البيتزا بحيث تكون إحدى نقاط المربع متجهة للأسفل.",
    "Position the straight side of a dough half circle along the upper left edge of the square. Place the other half circle along the upper right edge of the square. Press seams together to join.": "ضع الجانب المستقيم من نصف دائرة العجين على طول الحافة اليسرى العليا للمربع. ضع نصف الدائرة الأخرى على طول الحافة اليمنى العليا للمربع. اضغط على اللحامات معًا للانضمام.",
    "Spread pizza sauce over dough to 1/2-inch from the edge. Top pizza with shredded cheese, sausage and pepperoni.":"قم بتوزيع صلصة البيتزا فوق العجينة إلى مسافة ½ بوصة من الحافة. ​​ضع فوق البيتزا الجبن المبشور والنقانق والبيبروني.",

      "1 lemon": "1 ليمون",
      "350g dried Cucina Matese Italian Spaghetti":"350 جرامًا من الاسباجيتي",
      "250g carton mascarpone":"250 جرام جبن مسكربون",
    "150g baby spinach":"150 جرام سبانخ صغيرة",
    "150g smoked salmon slices, torn into large piece": "150 جرام شرائح سلمون مدخن، مقطعة إلى قطع كبيرة",
    "Use a peeler to cut wide strips of rind off the lemon then thinly slice lengthways into long thin strips. Juice the lemon.":"استخدمي مقشرة لقطع شرائح عريضة من قشر الليمون ثم قطعيها إلى شرائح رفيعة بالطول إلى شرائح رفيعة طويلة. اعصري الليمون.",
    "Pour juice and 1.25L (5 cups) water into a large saucepan. Cover. Bring to the boil over medium-high heat. Add pasta, stirring constantly, until water comes back to the boil.": "أسكبي العصير و1.25 لتر (5 أكواب) من الماء في قدر كبيرة. غطيها واتركيها حتى تغلي على نار متوسطة إلى عالية. أضيفي المعكرونة مع التحريك باستمرار حتى يعود الماء إلى الغليان.",
    "Reduce heat to medium. Cook, stirring every 2-3 minutes, for 12 minutes or until the pasta almost al dente. Add mascarpone and spinach. Cook, stirring, for 2 minutes or until the pasta is al dente and the mascarpone is melted. Remove from heat. Set aside for 2 minutes or until sauce thickens slightly.": "خففي الحرارة إلى متوسطة. اطهيها مع التحريك كل 2-3 دقائق لمدة 12 دقيقة أو حتى تنضج المعكرونة تقريبًا. أضيفي المسكربون والسبانخ. اطهيها مع التحريك لمدة دقيقتين أو حتى تنضج المعكرونة ويذوب المسكربون. - ارفعيه عن النار واتركيه جانباً لمدة دقيقتين أو حتى تتكاثف الصلصة قليلاً.",
    "Stir in rind and salmon. Season and serve.":"أضف القشرة وسمك السلمون. قم بتتبيلها وتقديمها."

  }